public class Main {
    public static void main(String[] args) {
        final Bank bank = new Bank();
        //Синхронизація через передачу класу у конструктор класів аби визивати метод в об'єктах
        //перший поток
        Thread1 th1 = new Thread1(bank);
        //другий поток з одним і тим самим об'єктом
        Thread2 th2 = new Thread2(bank);
        //спочатку виконуємо інкремент
        th1.start();
        //потім дикремент
        th2.start();
    }
}
/*
в Результаті ми отримуємо порядкові операції над об'єктом Банк
тобто 1й поток визиває метод інкримент блокує об'єкт поки метод не працює : а саме цикл по збільшунню значення поля
і тільки коли 1й поток закінчить свою роботу інший не починає,
тільки після закінчення роботи 1го Об'єкт розблоковується і виконується 2й поток дикримент зменшує значення поля того
самого об'єкту Bank
Якщо прибрати сінхронайзд у методах то об'єкт не блокується і 2й поток починає свою роботу не дочекавшись завершення
першого, або вплине не роботу першого чи самого себе, тому консоль не видасть потрібного результату, адже значення
буде змінюватися в залежності від нагрузки процесора однією чи іншою задачею.
 */